In [1]:
#$conda activate py37
#(py37)$ jupyter notebook

In [2]:
# %config IPCompleter.greedy=True

In [3]:
#press [SHIFT] and [TAB] from within the method parentheses

### intellisense - works perfect!! -> excute in command line windows. : (py37) $ -> works perfect !!
# (py37) $pip3 install jupyter-tabnine
# (py37) $sudo jupyter nbextension install --py jupyter_tabnine

# (py37) $jupyter nbextension enable jupyter_tabnine --py
##### jupyter nbextension enable --py jupyter_tabnine ##instead above line excuted. 

# (py37) $jupyter serverextension enable --py jupyter_tabnine

#--> I installed in (py37) conda env.

# Data Cleaning and Preparation

In [4]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Handling Missing Data
* pandas objects exclude missing data by default
* For numeric data, pandas uses the floating-point value **NaN (Not a Number)** to represent missing data.
* pandas missing data as **NA**(not available) data
* built-in Python **None** value is also treated as NA in object arrays:

In [6]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### NA handling methods
|Argument|Description|
|:-------|:----------|
|dropna|Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate|
|fillna|Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'|
|isnull||
|fillna||

### Filtering Out Missing Data

In [8]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA # 4 is column -
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [36]:
#test : label location -> number is label
print(data.loc[0:2,1:4])
print("----------------")
print(data.loc[0:2,[1,4]])
print("----------======")
print(data.loc[0,2])
data.loc[0,[2]]

     1    2   4
0  6.5  3.0 NaN
1  NaN  NaN NaN
2  NaN  NaN NaN
----------------
     1   4
0  6.5 NaN
1  NaN NaN
2  NaN NaN
----------======
3.0

2    3.0
Name: 0, dtype: float64

In [52]:
#test : index location -> number is index
print(data.iloc[0:2,1:4])
print("------------------")
print(data.iloc[0,2])
print("----------------")
print(data.iloc[0:2][[1,4]])
print("=========")
data.iloc[0,[2]]

     1    2   4
0  6.5  3.0 NaN
1  NaN  NaN NaN
------------------
3.0
----------------
     1   4
0  6.5 NaN
1  NaN NaN
=========

2    3.0
Name: 0, dtype: float64

In [26]:
data.loc[3]

0    NaN
1    6.5
2    3.0
4    NaN
Name: 3, dtype: float64

In [27]:
data.loc[:,2]

0    3.0
1    NaN
2    NaN
3    3.0
Name: 2, dtype: float64

In [16]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [59]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.000940  1.343810
3 -0.713544 -0.831154 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [60]:
df.iloc[:4, 1] = NA
df

          0         1         2
0  0.476985       NaN -1.021228
1 -0.577087       NaN  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [61]:
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.476985       NaN       NaN
1 -0.577087       NaN       NaN
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [64]:
df.dropna()

          0         1         2
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [65]:
df

          0         1         2
0  0.476985       NaN       NaN
1 -0.577087       NaN       NaN
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [63]:
df.dropna(thresh=2) #default row-wise

          0         1         2
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

### Filling In Missing Data

In [66]:
df.fillna(0)

          0         1         2
0  0.476985  0.000000  0.000000
1 -0.577087  0.000000  0.000000
2  0.523772  0.000000  1.343810
3 -0.713544  0.000000 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [67]:
df.fillna({1: 0.5, 2: 0}) #without inplace=True -> no change to df

          0         1         2
0  0.476985  0.500000  0.000000
1 -0.577087  0.500000  0.000000
2  0.523772  0.500000  1.343810
3 -0.713544  0.500000 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [68]:
df

          0         1         2
0  0.476985       NaN       NaN
1 -0.577087       NaN       NaN
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
6  0.332883 -2.359419 -0.199543

In [13]:
_ = df.fillna(0, inplace=True) #df changed!
df

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [98]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -1.022487 -0.402827  0.220487
1 -0.193401  0.669158 -1.648985
2 -2.252797 -1.166832  0.353607
3  0.702110 -0.274569 -0.139142
4  0.107657 -0.606545 -0.417064
5 -0.017007 -1.224145 -1.800840

In [99]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -1.022487 -0.402827  0.220487
1 -0.193401  0.669158 -1.648985
2 -2.252797       NaN  0.353607
3  0.702110       NaN -0.139142
4  0.107657       NaN       NaN
5 -0.017007       NaN       NaN

In [101]:
#option 1 - replace columns name
df.rename(columns={0:'a', 1:'b', 2:'c'}, inplace=True)
df

          a         b         c
0 -1.022487 -0.402827  0.220487
1 -0.193401  0.669158 -1.648985
2 -2.252797       NaN  0.353607
3  0.702110       NaN -0.139142
4  0.107657       NaN       NaN
5 -0.017007       NaN       NaN

In [105]:
#test
exist_columns = [0,1,2]
new_columns = list('abc')
{x:y for x, y in zip(exist_columns, new_columns) }

{0: 'a', 1: 'b', 2: 'c'}

In [106]:
#option 2
exist_columns = [0,1,2]
new_columns = list('abc')
{x:y for x, y in zip(exist_columns, new_columns) }
df.rename(columns={x:y for x, y in zip(exist_columns, new_columns)}, inplace=True)
#df

          a         b         c
0 -1.022487 -0.402827  0.220487
1 -0.193401  0.669158 -1.648985
2 -2.252797       NaN  0.353607
3  0.702110       NaN -0.139142
4  0.107657       NaN       NaN
5 -0.017007       NaN       NaN

In [114]:
#test
df.iloc[3:, 2]

3   -0.139142
4         NaN
5         NaN
Name: c, dtype: float64

In [116]:
#test
df.iloc[3:, 1:3]

    b         c
3 NaN -0.139142
4 NaN       NaN
5 NaN       NaN

In [119]:
df.columns = exist_columns #change columns name
df

          0         1         2
0 -1.022487 -0.402827  0.220487
1 -0.193401  0.669158 -1.648985
2 -2.252797       NaN  0.353607
3  0.702110       NaN -0.139142
4  0.107657       NaN       NaN
5 -0.017007       NaN       NaN

In [120]:
df.fillna(method='ffill')

          0         1         2
0 -1.022487 -0.402827  0.220487
1 -0.193401  0.669158 -1.648985
2 -2.252797  0.669158  0.353607
3  0.702110  0.669158 -0.139142
4  0.107657  0.669158 -0.139142
5 -0.017007  0.669158 -0.139142

In [74]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.541996 -0.970736 -1.307030
1  0.286350  0.377984 -0.753887
2  0.331286  0.377984  0.069877
3  0.246674  0.377984  1.004812
4  1.327195       NaN  1.004812
5  0.022185       NaN  1.004812

In [15]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [16]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [17]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [18]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [19]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [20]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [21]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [22]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [23]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [24]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [25]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [26]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [27]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [28]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [29]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [30]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [31]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [32]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [33]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [34]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [35]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

* sets the bins argument to a list of bin edge values. The left bin edge will be exclusive and the right bin edge will be inclusive.

* The bins will be for ages: (20, 29] (someone in their 20s), (30, 39], and (40, 49].

In [36]:
########## test start here !!###########
#randint(start, end, size) , size=(2,4) or just number(1-d)
df_ages = pd.DataFrame({'age': np.random.randint(21, 51, 8)})

In [37]:
df_ages

   age
0   33
1   26
2   29
3   32
4   43
5   42
6   22
7   21

In [38]:
df_ages['age_bins'] = pd.cut(x=df_ages['age'], bins=[20, 29, 39, 49])

In [39]:
df_ages

   age  age_bins
0   33  (29, 39]
1   26  (20, 29]
2   29  (20, 29]
3   32  (29, 39]
4   43  (39, 49]
5   42  (39, 49]
6   22  (20, 29]
7   21  (20, 29]

In [40]:
########### end of test #########

In [41]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

#### Return  one of follwing bins - (18,25], (25,35], (35, 60], (60, 100] - which each element in ages list belongs

In [50]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [51]:
cats.codes
cats.categories
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [52]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [53]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [54]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.52, 0.74], (0.3, 0.52], (0.52, 0.74], (0.74, 0.97], (0.74, 0.97], ..., (0.52, 0.74], (0.52, 0.74], (0.52, 0.74], (0.3, 0.52], (0.52, 0.74]]
Length: 20
Categories (4, interval[float64]): [(0.076, 0.3] < (0.3, 0.52] < (0.52, 0.74] < (0.74, 0.97]]

In [55]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats
pd.value_counts(cats)

(0.67, 3.542]       250
(0.0234, 0.67]      250
(-0.698, 0.0234]    250
(-3.307, -0.698]    250
dtype: int64

In [56]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-3.307, -1.35], (1.212, 3.542], (1.212, 3.542], (-1.35, 0.0234], (0.0234, 1.212], ..., (1.212, 3.542], (0.0234, 1.212], (-1.35, 0.0234], (-1.35, 0.0234], (-1.35, 0.0234]]
Length: 1000
Categories (4, interval[float64]): [(-3.307, -1.35] < (-1.35, 0.0234] < (0.0234, 1.212] < (1.212, 3.542]]

### Detecting and Filtering Outliers

In [57]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000174    -0.004976    -0.007642     0.032265
std       1.046593     1.010767     0.991262     0.999309
min      -2.710790    -2.783603    -2.896403    -3.422820
25%      -0.752763    -0.732547    -0.676048    -0.624649
50%      -0.063788    -0.025135    -0.039940     0.026127
75%       0.726094     0.638847     0.625783     0.736454
max       3.183761     3.442215     3.730701     2.858813

In [58]:
col = data[2]
col[np.abs(col) > 3]

217    3.142646
256    3.024318
718    3.730701
917    3.481456
Name: 2, dtype: float64

In [59]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
124  3.183761  0.394377  0.093516 -1.219909
217  1.563627  1.599890  3.142646 -0.046947
256 -0.911976 -0.650618  3.024318  0.507452
516 -0.586454  3.442215 -0.508829 -0.071672
616  3.058101 -1.071824  2.251032 -0.032254
718 -0.261077  0.538081  3.730701  0.394302
874 -1.860894 -0.339453 -1.055908 -3.422820
917 -1.993258  0.099892  3.481456 -0.633410

In [60]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000068    -0.005418    -0.009021     0.032688
std       1.045881     1.009353     0.986665     0.997934
min      -2.710790    -2.783603    -2.896403    -3.000000
25%      -0.752763    -0.732547    -0.676048    -0.624649
50%      -0.063788    -0.025135    -0.039940     0.026127
75%       0.726094     0.638847     0.625783     0.736454
max       3.000000     3.000000     3.000000     2.858813

In [61]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1 -1.0 -1.0 -1.0  1.0
2  1.0 -1.0 -1.0  1.0
3  1.0  1.0  1.0 -1.0
4  1.0 -1.0  1.0 -1.0

### Permutation and Random Sampling

In [62]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([4, 3, 0, 1, 2])

In [168]:
df
df.take(sampler)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3

In [169]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11

In [170]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

4    4
1    7
4    4
2   -1
0    5
3    6
1    7
4    4
0    5
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [216]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [217]:
df['key']

0    b
1    b
2    a
3    c
4    a
5    b
Name: key, dtype: object

In [171]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [172]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [173]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

/home/snupos/anaconda3/envs/py3/lib/python3.7/site-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [174]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [175]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [176]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [177]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [178]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [179]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                      1
title                          Toy Story (1995)
genres              Animation|Children's|Comedy
Genre_Animation                               1
Genre_Children's                              1
                               ...
Genre_War                                     0
Genre_Musical                                 0
Genre_Mystery                                 0
Genre_Film-Noir                               0
Genre_Western                                 0
Name: 0, Length: 21, dtype: object

In [180]:
np.random.seed(12345)
values = np.random.rand(10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String Manipulation

### String Object Methods

In [181]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [182]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [183]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [184]:
'::'.join(pieces)

'a::b::guido'

In [185]:
'guido' in val
val.index(',')
val.find(':')

-1

In [211]:
val = 'a,b,  guido'
try:
    val.index(':')
except ValueError as err:
    print(err)

substring not found

In [189]:
val.count(',')

2

In [190]:
val.replace(',', '::')
val.replace(',', '')

'ab  guido'

### Regular Expressions

In [191]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [192]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [193]:
regex.findall(text)

['    ', '\t ', '  \t']

In [194]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [195]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [196]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [197]:
print(regex.match(text))

None

In [198]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [199]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [200]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [201]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [202]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [203]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [204]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [205]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [206]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [214]:
try:
   matches.str.get(1)
except AttributeError as err:
    print(err)
    
try:
    matches.str[0]
except AttributeError as err:
    print(err)

Can only use .str accessor with string values!
Can only use .str accessor with string values!

In [208]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [215]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

## Conclusion